fixes the diagramms
